spot/spot_src/doc/userdoc/tut22.html

<div id="outline-container-org4cc0e72" class="outline-3">
<h3 id="cpp"><a id="org4cc0e72"></a>C++</h3>
<div class="outline-text-3" id="text-cpp">
<div class="org-src-container">
<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;spot/twaalgos/hoa.hh&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;spot/twa/twagraph.hh&gt;</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>(<span class="org-type">void</span>)
{
  <span class="org-comment-delimiter">// </span><span class="org-comment">The bdd_dict is used to maintain the correspondence between the</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">atomic propositions and the BDD variables that label the edges of</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">the automaton.</span>
  <span class="org-constant">spot</span>::<span class="org-type">bdd_dict_ptr</span> <span class="org-variable-name">dict</span> = <span class="org-constant">spot</span>::make_bdd_dict();
  <span class="org-comment-delimiter">// </span><span class="org-comment">This creates an empty automaton that we have yet to fill.</span>
  <span class="org-constant">spot</span>::<span class="org-type">twa_graph_ptr</span> <span class="org-variable-name">aut</span> = make_twa_graph(dict);

  <span class="org-comment-delimiter">// </span><span class="org-comment">Since a BDD is associated to every atomic proposition, the</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">register_ap() function returns a BDD variable number</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">that can be converted into a BDD using bdd_ithvar().</span>
  <span class="org-type">bdd</span> <span class="org-variable-name">p1</span> = bdd_ithvar(aut-&gt;register_ap(<span class="org-string">"p1"</span>));
  <span class="org-type">bdd</span> <span class="org-variable-name">p2</span> = bdd_ithvar(aut-&gt;register_ap(<span class="org-string">"p2"</span>));

  <span class="org-comment-delimiter">// </span><span class="org-comment">Set the acceptance condition of the automaton to Inf(0)&amp;Inf(1)</span>
  aut-&gt;set_generalized_buchi(2);

  <span class="org-comment-delimiter">// </span><span class="org-comment">States are numbered from 0.</span>
  aut-&gt;new_states(3);
  <span class="org-comment-delimiter">// </span><span class="org-comment">The default initial state is 0, but it is always better to</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">specify it explicitly.</span>
  aut-&gt;set_init_state(0U);

  <span class="org-comment-delimiter">// </span><span class="org-comment">new_edge() takes 3 mandatory parameters: source state,</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">destination state, and label.  A last optional parameter can be</span>
  <span class="org-comment-delimiter">// </span><span class="org-comment">used to specify membership to acceptance sets.</span>
  aut-&gt;new_edge(0, 1, p1);
  aut-&gt;new_edge(1, 1, p1 &amp; p2, {0});
  aut-&gt;new_edge(1, 2, p2, {1});
  aut-&gt;new_edge(2, 1, p1 | p2, {0, 1});

  <span class="org-comment-delimiter">// </span><span class="org-comment">Print the resulting automaton.</span>
  print_hoa(<span class="org-constant">std</span>::cout, aut);
  <span class="org-keyword">return</span> 0;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-hoa"><span class="org-hoa-header-uppercase">HOA:</span> v1
<span class="org-hoa-header-uppercase">States:</span> 3
<span class="org-hoa-header-uppercase">Start:</span> 0
<span class="org-hoa-header-uppercase">AP:</span> 2 <span class="org-string">"p1"</span> <span class="org-string">"p2"</span>
<span class="org-hoa-header-lowercase">acc-name:</span> generalized-Buchi 2
<span class="org-hoa-header-uppercase">Acceptance:</span> 2 <span class="org-hoa-builtin">Inf</span>(<span class="org-hoa-acceptance-set">0</span>)&amp;<span class="org-hoa-builtin">Inf</span>(<span class="org-hoa-acceptance-set">1</span>)
<span class="org-hoa-header-lowercase">properties:</span> trans-labels explicit-labels trans-acc
<span class="org-hoa-keyword">--BODY--</span>
<span class="org-hoa-header-uppercase">State:</span> 0
[<span class="org-hoa-ap-number">0</span>] 1
<span class="org-hoa-header-uppercase">State:</span> 1
[<span class="org-hoa-ap-number">0</span>&amp;<span class="org-hoa-ap-number">1</span>] 1 {<span class="org-hoa-acceptance-set">0</span>}
[<span class="org-hoa-ap-number">1</span>] 2 {<span class="org-hoa-acceptance-set">1</span>}
<span class="org-hoa-header-uppercase">State:</span> 2
[<span class="org-hoa-ap-number">0</span> | <span class="org-hoa-ap-number">1</span>] 1 {<span class="org-hoa-acceptance-set">0 1</span>}
<span class="org-hoa-keyword">--END--</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd01211d" class="outline-3">
<h3 id="orgd01211d">Python</h3>
<div class="outline-text-3" id="text-orgd01211d">
<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">import</span> spot
<span class="org-keyword">import</span> buddy

<span class="org-comment-delimiter"># </span><span class="org-comment">The bdd_dict is used to maintain the correspondence between the</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">atomic propositions and the BDD variables that label the edges of</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">the automaton.</span>
<span class="org-variable-name">bdict</span> = spot.make_bdd_dict();
<span class="org-comment-delimiter"># </span><span class="org-comment">This creates an empty automaton that we have yet to fill.</span>
<span class="org-variable-name">aut</span> = spot.make_twa_graph(bdict)

<span class="org-comment-delimiter"># </span><span class="org-comment">Since a BDD is associated to every atomic proposition, the register_ap()</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">function returns a BDD variable number that can be converted into a BDD</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">using bdd_ithvar() from the BuDDy library.</span>
<span class="org-variable-name">p1</span> = buddy.bdd_ithvar(aut.register_ap(<span class="org-string">"p1"</span>))
<span class="org-variable-name">p2</span> = buddy.bdd_ithvar(aut.register_ap(<span class="org-string">"p2"</span>))

<span class="org-comment-delimiter"># </span><span class="org-comment">Set the acceptance condition of the automaton to Inf(0)&amp;Inf(1)</span>
aut.set_generalized_buchi(2)

<span class="org-comment-delimiter"># </span><span class="org-comment">States are numbered from 0.</span>
aut.new_states(3)
<span class="org-comment-delimiter"># </span><span class="org-comment">The default initial state is 0, but it is always better to</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">specify it explicitly.</span>
aut.set_init_state(0)

<span class="org-comment-delimiter"># </span><span class="org-comment">new_edge() takes 3 mandatory parameters: source state, destination state,</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">and label.  A last optional parameter can be used to specify membership to</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">acceptance sets.  In the Python version, the list of acceptance sets the</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">transition belongs to should be specified as a list.</span>
aut.new_edge(0, 1, p1)
aut.new_edge(1, 1, p1 &amp; p2, [0])
aut.new_edge(1, 2, p2, [1]);
aut.new_edge(2, 1, p1 | p2, [0, 1]);

<span class="org-comment-delimiter"># </span><span class="org-comment">Print the resulting automaton.</span>
<span class="org-keyword">print</span>(aut.to_str(<span class="org-string">'hoa'</span>))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-hoa"><span class="org-hoa-header-uppercase">HOA:</span> v1
<span class="org-hoa-header-uppercase">States:</span> 3
<span class="org-hoa-header-uppercase">Start:</span> 0
<span class="org-hoa-header-uppercase">AP:</span> 2 <span class="org-string">"p1"</span> <span class="org-string">"p2"</span>
<span class="org-hoa-header-lowercase">acc-name:</span> generalized-Buchi 2
<span class="org-hoa-header-uppercase">Acceptance:</span> 2 <span class="org-hoa-builtin">Inf</span>(<span class="org-hoa-acceptance-set">0</span>)&amp;<span class="org-hoa-builtin">Inf</span>(<span class="org-hoa-acceptance-set">1</span>)
<span class="org-hoa-header-lowercase">properties:</span> trans-labels explicit-labels trans-acc
<span class="org-hoa-keyword">--BODY--</span>
<span class="org-hoa-header-uppercase">State:</span> 0
[<span class="org-hoa-ap-number">0</span>] 1
<span class="org-hoa-header-uppercase">State:</span> 1
[<span class="org-hoa-ap-number">0</span>&amp;<span class="org-hoa-ap-number">1</span>] 1 {<span class="org-hoa-acceptance-set">0</span>}
[<span class="org-hoa-ap-number">1</span>] 2 {<span class="org-hoa-acceptance-set">1</span>}
<span class="org-hoa-header-uppercase">State:</span> 2
[<span class="org-hoa-ap-number">0</span> | <span class="org-hoa-ap-number">1</span>] 1 {<span class="org-hoa-acceptance-set">0 1</span>}
<span class="org-hoa-keyword">--END--</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc77b581" class="outline-2">
<h2 id="sba"><a id="orgc77b581"></a>Büchi automaton, with state-based acceptance</h2>
<div class="outline-text-2" id="text-sba">
<p>
Spot does not really support state-based acceptance condition; this is
faked as follows:
</p>

<ul class="org-ul">
<li>instead of marking states as accepting, we mark <b>all</b> outgoing edges
of accepting states,</li>
<li>additionally, we set <code>prop_state_acc(true)</code> to indicate that the
automaton should output as if it were state-based.</li>
</ul>

<p>
Some algorithm recognize the <code>prop_state_acc()</code> properties and trigger
some special handling of the automaton, maybe to preserve its "fake
state-based nature".
</p>

<p>
The <code>print_hoa()</code> function will check that automata marked with
<code>prop_state_acc()</code> are actually using the same acceptance sets on all
outgoing transitions of each state, and raise an exception otherwise.
</p>

<p>
In the following example, we are going to use Büchi acceptance, but
<code>prop_state_acc()</code> can be used with any acceptance.  Again, this property
should be read as "this automaton with transition-based acceptance
is actually encoding a state-based acceptance, so treat it as follows
whenever possible".
</p>
</div>
